{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"name": "input", "batch_input_shape": [null, 180, 180, 3], "dtype": "float32", "sparse": false}, "name": "input", "inbound_nodes": []}, {"class_name": "Model", "config": {"output_layers": [["block5_pool", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "vgg16", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, null, null, 3], "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block1_conv1", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block1_conv2", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block1_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block2_conv1", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 128, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block2_conv2", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 128, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block2_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block3_conv1", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block3_conv2", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block3_conv3", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 256, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block3_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block4_conv1", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block4_conv2", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block4_conv3", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block4_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block5_conv1", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block5_conv2", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "name": "block5_conv3", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_constraint": null, "trainable": true, "filters": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "block5_pool", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}]}, "name": "vgg16", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}, "name": "flatten", "inbound_nodes": [[["vgg16", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "fc1", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "trainable": true, "units": 4096, "bias_regularizer": null}, "name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "fc2", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "trainable": true, "units": 4096, "bias_regularizer": null}, "name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "predictions", "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "trainable": true, "units": 5271, "bias_regularizer": null}, "name": "predictions", "inbound_nodes": [[["fc2", 0, 0, {}]]]}]}, "backend": "tensorflow", "keras_version": "2.1.1"}