{"class_name": "Model", "keras_version": "2.0.6", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 90, 90, 3], "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "block1_conv1", "filters": 32, "activity_regularizer": null, "bias_regularizer": null, "trainable": false, "activation": "linear", "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "name": "block1_conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block1_conv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block1_conv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block1_conv1_act", "activation": "relu"}, "name": "block1_conv1_act"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "block1_conv2", "filters": 64, "activity_regularizer": null, "bias_regularizer": null, "trainable": false, "activation": "linear", "data_format": "channels_last", "padding": "valid", "strides": [1, 1]}, "name": "block1_conv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block1_conv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block1_conv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block1_conv2_act", "activation": "relu"}, "name": "block1_conv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block2_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 128, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block2_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block2_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block2_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block2_sepconv2_act", "activation": "relu"}, "name": "block2_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block2_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 128, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block2_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block2_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block2_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_1", "filters": 128, "activity_regularizer": null, "bias_regularizer": null, "trainable": false, "activation": "linear", "data_format": "channels_last", "padding": "same", "strides": [2, 2]}, "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "block2_pool", "padding": "same", "data_format": "channels_last", "trainable": false, "strides": [2, 2]}, "name": "block2_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "batch_normalization_1", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_1"}, {"class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": false, "name": "add_1"}, "name": "add_1"}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": false, "name": "block3_sepconv1_act", "activation": "relu"}, "name": "block3_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block3_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 256, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block3_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block3_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block3_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block3_sepconv2_act", "activation": "relu"}, "name": "block3_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block3_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 256, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block3_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block3_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block3_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_2", "filters": 256, "activity_regularizer": null, "bias_regularizer": null, "trainable": false, "activation": "linear", "data_format": "channels_last", "padding": "same", "strides": [2, 2]}, "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "block3_pool", "padding": "same", "data_format": "channels_last", "trainable": false, "strides": [2, 2]}, "name": "block3_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "batch_normalization_2", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_2"}, {"class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": false, "name": "add_2"}, "name": "add_2"}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": false, "name": "block4_sepconv1_act", "activation": "relu"}, "name": "block4_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block4_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block4_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block4_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block4_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block4_sepconv2_act", "activation": "relu"}, "name": "block4_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block4_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block4_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block4_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block4_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_3", "filters": 728, "activity_regularizer": null, "bias_regularizer": null, "trainable": false, "activation": "linear", "data_format": "channels_last", "padding": "same", "strides": [2, 2]}, "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "block4_pool", "padding": "same", "data_format": "channels_last", "trainable": false, "strides": [2, 2]}, "name": "block4_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "batch_normalization_3", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "batch_normalization_3"}, {"class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": false, "name": "add_3"}, "name": "add_3"}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": false, "name": "block5_sepconv1_act", "activation": "relu"}, "name": "block5_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block5_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block5_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block5_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block5_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block5_sepconv2_act", "activation": "relu"}, "name": "block5_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block5_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block5_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block5_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block5_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block5_sepconv3_act", "activation": "relu"}, "name": "block5_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block5_sepconv3", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block5_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block5_sepconv3_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block5_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"trainable": false, "name": "add_4"}, "name": "add_4"}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": false, "name": "block6_sepconv1_act", "activation": "relu"}, "name": "block6_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block6_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block6_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block6_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block6_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block6_sepconv2_act", "activation": "relu"}, "name": "block6_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block6_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block6_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block6_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block6_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block6_sepconv3_act", "activation": "relu"}, "name": "block6_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block6_sepconv3", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block6_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block6_sepconv3_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block6_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "config": {"trainable": false, "name": "add_5"}, "name": "add_5"}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": false, "name": "block7_sepconv1_act", "activation": "relu"}, "name": "block7_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block7_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block7_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block7_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block7_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block7_sepconv2_act", "activation": "relu"}, "name": "block7_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block7_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block7_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block7_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block7_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block7_sepconv3_act", "activation": "relu"}, "name": "block7_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block7_sepconv3", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block7_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block7_sepconv3_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block7_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"trainable": false, "name": "add_6"}, "name": "add_6"}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": false, "name": "block8_sepconv1_act", "activation": "relu"}, "name": "block8_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block8_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block8_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block8_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block8_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block8_sepconv2_act", "activation": "relu"}, "name": "block8_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block8_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block8_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block8_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block8_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block8_sepconv3_act", "activation": "relu"}, "name": "block8_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block8_sepconv3", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block8_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block8_sepconv3_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block8_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "config": {"trainable": false, "name": "add_7"}, "name": "add_7"}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": false, "name": "block9_sepconv1_act", "activation": "relu"}, "name": "block9_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block9_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block9_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block9_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block9_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block9_sepconv2_act", "activation": "relu"}, "name": "block9_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block9_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block9_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block9_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block9_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block9_sepconv3_act", "activation": "relu"}, "name": "block9_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block9_sepconv3", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block9_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block9_sepconv3_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block9_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]], "config": {"trainable": false, "name": "add_8"}, "name": "add_8"}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": false, "name": "block10_sepconv1_act", "activation": "relu"}, "name": "block10_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block10_sepconv1", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block10_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block10_sepconv1_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block10_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block10_sepconv2_act", "activation": "relu"}, "name": "block10_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block10_sepconv2", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": false, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1]}, "name": "block10_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "block10_sepconv2_bn", "scale": true, "epsilon": 0.001, "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "trainable": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}, "name": "block10_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]], "config": {"trainable": false, "name": "block10_sepconv3_act", "activation": "relu"}, "name": "block10_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv3_act", 0, 0, {}]]], "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "pointwise_constraint": null, "depthwise_constraint": null, "bias_regularizer": null, "name": "block10_sepconv3", "activation": "linear", "bias_constraint": null, "padding": "same", "depthwise_regularizer": null, "depth_multiplier": 1, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": false, "filters": 728, "pointwise_regularizer": null, "activity_regularizer": null, "depthwise_initializer": 